<font size="6" face="verdana" color="green">
    <b>Exploração inicial das tabelas da Base de dados <u>Alunos15</u></b>
</font>
<div align="right"><font size="1" face="arial" color="gray">14 cel</font></div>

<br><br>

**Objetivo:** Preparar o ambiente para explorar comandos básicos da linguagem SQL, usando uma &nbsp; <i>toy database</i> &nbsp; como exemplo, contendo dados de mátriculas de 15 alunos: a base de Dados `Alunos15`\

__Atividades:__ 
 * Instalar os pacotes de Python que serão usados nos exercícios;
 * Ganhar familiaridade com o SGBDR PostgreSQL.
 * Preparar a base de dados `alunos15` criando seis tabelas no PostgreSQL
 * Carregar dados sobre 15 alunos nessa base;
 * Explorar algumas informações interessantes do Meta-esquema do SGBD  

<br><br>

## 1. Conectar com a Base de Dados

Para acessar uma base a partir de um notebook, é necessário primeiro 
  * carregar os pacotes necessários e
  * se conectar com a base:

In [1]:
import pandas as pd
import ipywidgets as widgets
from sqlalchemy import create_engine

In [ ]:
#Conectar com um servidor SQL na base Alunos 15 
%load_ext sql
# %reload_ext sql

# Connection format: %sql dialect+driver://username:password@host:port/database
engine = create_engine('postgresql://postgres:postgres@localhost:5432/alunos15')
%sql postgresql://postgres:postgres@localhost:5432/alunos15

Após carregar uma base de dados, é importante analisar as estatísticas da base por meio do commando `VACCUM [ANALYZE]`:

In [37]:
%config SqlMagic.autocommit=False
%sql  COMMIT;  VACUUM;  COMMIT;
%config SqlMagic.autocommit=True

   postgresql://postgres:***@localhost/alunos15
 * postgresql://postgres:***@localhost:5432/alunos15
Done.
Done.
Done.

<br><br>
## 2. Explorar a base de dados alunos15

As tabelas usadas nos exemplos são: `Alunos`, `Discip`, `Turma`, `Matricula` e `Professor`.<br>

Vamos usar as tabelas do <b>Meta-Esquema</b> do SGBD para verificar a quantidade de atributos e de tuplas dessas tabelas:

In [2]:
engine2 = create_engine('postgresql+psycopg2://postgres:postgres@localhost:5432/alunos15')

In [6]:
# engine2 = create_engine('postgresql+psycopg2://postgres:postgres@localhost:5432/alunos15')

query = """
SELECT TC.RelName, TC.RelNatts, SchemaName, TC.RelTuples::INT, TC.RelPages                         
FROM pg_catalog.pg_tables TN JOIN Pg_Class TC ON TN.TableName=TC.RelName
WHERE RelName !~'(pg_)|(sql_)'
ORDER BY 1;
"""

df = pd.read_sql_query(query, engine2)
df.head()

     relname  relnatts schemaname  reltuples  relpages
0      aluno         4     public         15         1
1     discip         4     public          3         1
2  matricula         3     public         32         1
3   ministra         3     public         15         1
4  professor         4     public          9         1

<br>

Para verificar as tuplas das tabelas `Alunos` e `Disciplinas`:

In [8]:
query_table_aluno =  """SELECT * FROM Aluno"""
df_table_aluno = pd.read_sql_query(query_table_aluno, engine2)
df_table_aluno.head()

       nome    nusp  idade      cidade
0    Carlos  1234.0   21.0  Sao Carlos
1     Celso  2345.0   22.0  Sao Carlos
2    Cicero  3456.0   22.0  Araraquara
3  Carlitos  4567.0   21.0    Ibitinga
4  Catarina  5678.0   23.0  Sao Carlos

In [9]:
query_table_disciplina = """SELECT * FROM Discip"""
df_table_disciplina = pd.read_sql_query(query_table_disciplina, engine2)
df_table_disciplina.head()

     sigla                nome siglaprereq  nncred
0  SCE-179       Base de Dados     SMA-179     4.0
1  SMA-179             Algebra                 3.0
2  SCE-200  Lab. Base de Dados     SCE-179     4.0

<br>

Os alunos não se matriculam diretamente nas disciplinas, mas sim nas turmas criadas para cada disciplina.\
Pode haver mais de uma turma para cada disciplina.

In [10]:
# %sql  tabTurma << SELECT * FROM Turma;
# print('\nTurma:\n', tabTurma, sep='')

query_table_turma = """SELECT * FROM Turma;"""
df_table_turma = pd.read_sql_query(query_table_turma, engine2)
df_table_turma.head()

     sigla  numero  codigo  nnalunos
0  SCE-179     1.0   100.0      30.0
1  SMA-179     1.0   101.0      25.0
2  SMA-179     2.0   102.0      30.0
3  SCE-200     1.0   103.0      30.0
4  SCE-200     2.0   104.0      40.0

In [11]:
# %sql  tabMatricula << SELECT * FROM Matricula;
# print('\nMatricula:\n', tabMatricula, sep='')

query_table_matricula = """SELECT * FROM Matricula;"""
df_table_matricula = pd.read_sql_query(query_table_matricula, engine2)
df_table_matricula.head()

   codigoturma    nusp  nota
0        100.0  1234.0   8.0
1        100.0  2345.0   9.0
2        100.0  4567.0   7.0
3        100.0  8901.0   4.0
4        100.0  9123.0   9.0

<br>

Para listar as notas de um aluno em todas as disciplinas por ele/a cursadas:

In [12]:
# %%sql
# SELECT A.Nome, D.Nome, M.Nota, A.NUSP
#     FROM Aluno A JOIN Matricula M ON A.NUSP=M.NUSP
#                  JOIN Turma T ON M.CodigoTurma=T.Codigo
#                  JOIN Discip D ON T.Sigla=D.Sigla
#     WHERE M.Nota>=5
#     ORDER BY A.Nome, D.Nome
#     LIMIT 10;

query_alunos_disciplina = """SELECT A.Nome, D.Nome, M.Nota, A.NUSP
    FROM Aluno A JOIN Matricula M ON A.NUSP=M.NUSP
                 JOIN Turma T ON M.CodigoTurma=T.Codigo
                 JOIN Discip D ON T.Sigla=D.Sigla
    WHERE M.Nota>=5
    ORDER BY A.Nome, D.Nome
    LIMIT 10;"""
df_alunos_disciplina = pd.read_sql_query(query_alunos_disciplina, engine2)
df_alunos_disciplina.head(10)

       nome                nome  nota    nusp
0  Carlitos             Algebra  10.0  4567.0
1  Carlitos       Base de Dados   7.0  4567.0
2    Carlos             Algebra   9.0  1234.0
3    Carlos       Base de Dados   8.0  1234.0
4  Catarina             Algebra   7.0  5678.0
5  Catarina  Lab. Base de Dados   8.0  5678.0
6     Celia             Algebra   9.0  9012.0
7     Celia       Base de Dados   6.0  9012.0
8     Celia  Lab. Base de Dados   9.0  9012.0
9    Celina             Algebra   9.0  8901.0

<br><br>
## 5. Explorar algumas tabelas do <b>Meta-esquema do PostgreSQL</b>

<br>

#### 5.1. A tabela `PG_Class`:
A principal tabela para acessar as informações do <b>Meta-Esquema</b> de uma base de dados é a `PG_Class`.\
Ela tem as principais informações sobre as `table`, `view`, `index` e demais objetos que podem ser generalizados como uma tabela.
Alguns dados interessantes são:
 * `OId:` o identificador interno da tabela
 * `RelName:` o nome da tabela
 * `RelNameSpace:` o nome do esquema ('NameSpace') onde o nome do objeto está definido (referencia `PG_NameSpace.OId`)
 * `RelKind:` o tipo do objeto: 'r'=tabela, 'i'=índice, 'v'=visão, 'm'=visão materializada, etc.
 * `RelAM:` organização do objeto  (referência `PG_AM.OId`). Se for tabela, se a armazenagem é por tupla ou coluna; se for índice, a estrutura de dados (b-tree, hash, r-tree, etc.)
 * `RelPages:` quantidade de páginas de 8KBytes ocupadas em disco
 * `RelTuples:` quantidade de tuplas armazenadas
 * `RelNAtts:` quantidade de atributos em cada tupla, sem contar os atributos de sistema.
   A tabela `PG_Attribute` contem as informações sobre cada um dos atributos

Por exemplo:

In [3]:
# %%sql
# SELECT OId, RelName, RelKind, RelNameSpace, RelAM, RelPages, RelTuples, RelNAtts
#     FROM PG_Class
#     WHERE RelName='aluno' OR RelName='professor';

query_table_scheme = """SELECT OId, RelName, RelKind, RelNameSpace, RelAM, RelPages, RelTuples, RelNAtts
    FROM PG_Class
    WHERE RelName='aluno' OR RelName='professor';"""
df_table_scheme = pd.read_sql_query(query_table_scheme, engine2)
df_table_scheme.head()

,oid,relname,relkind,relnamespace,relam,relpages,reltuples,relnatts
0,16388,professor,r,2200,2,1,9.0,4
1,16391,aluno,r,2200,2,1,15.0,4

Quando um atributo se referencia a um objeto em outra tabela, podemos buscar as informações desse objeto na tabela correspondente.

<br>

#### 5.2 A tabela `PG_NameSpace`
Por exemplo, o `NameSpace` de uma tabela é o esquema onde ele está definido.\
Podemos obter as informações sobre o esquema onde a tabela `Aluno` está definida olhando a relação referenciada: `pg_namespace':

In [4]:
# %%sql
# SELECT C.RelName, S.*
#     FROM PG_Class C JOIN PG_NameSpace S ON C.RelNameSpace = S.OId
#     WHERE C.RelName='aluno' OR C.RelName='professor';

query_table_namespace = """SELECT C.RelName, S.*
    FROM PG_Class C JOIN PG_NameSpace S ON C.RelNameSpace = S.OId
    WHERE C.RelName='aluno' OR C.RelName='professor';"""

df_table_namespace = pd.read_sql_query(query_table_namespace, engine2)
df_table_namespace.head()

,relname,oid,nspname,nspowner,nspacl
0,professor,2200,public,6171,"{pg_database_owner=UC/pg_database_owner,=U/pg_..."
1,aluno,2200,public,6171,"{pg_database_owner=UC/pg_database_owner,=U/pg_..."


Se quizermos ver todos os esquemas da base de dados com todos os seus atributos podemos solicitar:

In [5]:
# %%sql
# SELECT S.* FROM PG_NameSpace S;
query_database_scheme = """SELECT S.* FROM PG_NameSpace S;"""
df_database_scheme = pd.read_sql_query(query_database_scheme, engine2)
df_database_scheme.head()

,oid,nspname,nspowner,nspacl
0,99,pg_toast,10,None
1,11,pg_catalog,10,"{postgres=UC/postgres,=U/postgres}"
2,2200,public,6171,"{pg_database_owner=UC/pg_database_owner,=U/pg_..."
3,14650,information_schema,10,"{postgres=UC/postgres,=U/postgres}"

Veja que além do esquema público, existem os esquemas internos do próprio PostgreSQL

Se quizermos ver todos os esquemas definidos pelo usuário (incluindo o esquema `Public`) podemos filtrar:
 - os esquemas de trabalho do PostgreSQL (`LIKE 'pg\_%'`) e
 - o esquema padrão ISO (`LIKE 'Information\_schema'`).

<br>

Filtrando usando uma Expressão Regular independente da caixa da letra (`~*`), o comando fica:

In [7]:
# %%sql
# SELECT S.*
# FROM PG_NameSpace S 
# WHERE NspName !~*'(pg_)|(Information_schema)';

query_internal_scheme = """SELECT S.*
FROM PG_NameSpace S 
WHERE NspName !~*'(pg_)|(Information_schema)';"""
df_internal_scheme = pd.read_sql_query(query_internal_scheme, engine2)
df_internal_scheme.head()

    oid nspname  nspowner                                             nspacl
0  2200  public      6171  {pg_database_owner=UC/pg_database_owner,=U/pg_...

<br>

#### 5.3 A tabela `PG_Attribute`

As informações sobre cada atributo de uma tabela estão na relação `PG_Attribute`. Dentre as mais interessantes estão:
 * `AttRelId`: indentifica a tabela (em `PG_Class.Oid`) que contém esse atributo
 * `Attname`: o nome do atributo
 * `AttNum`: Posição ordinal desse atributo na tabela
 * `AttLen`: Número de bytes que esse atributo ocupa na tupla. -1 se for variável
 * `AttTypId`: o identificador do tipo de dados do atributo (referencia PG_Type.OId)

In [9]:
# %%sql
# SELECT C.RelName, A.AttRelId, A.AttName, A.AttNum, A.AttLen, A. AttTypId, T.TypName
#     FROM Pg_Class C JOIN Pg_Attribute A ON C.OID = A.AttRelId
#                     JOIN Pg_Type T      ON A.AttTypId=T.OID
#     WHERE (C.RelName = 'aluno' OR C.RelName = 'matricula')
#       AND A.AttNum>0   -- AttNum<0 ==> Atributo de sistema
#     ORDER BY 1,4;

query_table_attribute = """SELECT C.RelName, A.AttRelId, A.AttName, A.AttNum, A.AttLen, A. AttTypId, T.TypName
    FROM Pg_Class C JOIN Pg_Attribute A ON C.OID = A.AttRelId
                    JOIN Pg_Type T      ON A.AttTypId=T.OID
    WHERE (C.RelName = 'aluno' OR C.RelName = 'matricula')
      AND A.AttNum>0   -- AttNum<0 ==> Atributo de sistema
    ORDER BY 1,4;"""
df_table_attribute = pd.read_sql_query(query_table_attribute, engine2)
df_table_attribute.head()

     relname  attrelid      attname  attnum  attlen  atttypid  typname
0      aluno     16391         nome       1      -1      1043  varchar
1      aluno     16391         nusp       2      -1      1700  numeric
2      aluno     16391        idade       3      -1      1700  numeric
3      aluno     16391       cidade       4      -1      1043  varchar
4  matricula     16400  codigoturma       1      -1      1700  numeric

<br><br>

A documentação das tabelas do <b>Meta-esquema</b> pode ser encontrada no manual do PostgreSQL em:\
https://www.postgresql.org/docs/current/catalogs.html

<br><br>
<font size="4" face="verdana" color="green">
     <b>Exploração inicial das tabelas da Base de dados __Alunos15</b>
    </font><br>